app/controllers/static_controller.rb

SELECT "potins".* FROM "potins"
---
  def welcome
    @prenom = params[:prenom].capitalize
    @Gossips = Potin.all